EH_OpenFOAM/settle_case/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100;

boundaryField
{
    bottom
    {
        type            calculated;
        value           uniform 100;
    }
    top
    {
        type            calculated;
        value           uniform 100;
    }
    lateralWall
    {
        type            calculated;
        value           uniform 100;
    }
}


// ************************************************************************* //
