EH_OpenFOAM/settle_case/0.org/phifs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      phifs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.014;

boundaryField
{
    bottom
    {
        type            codedMixed;
        refValue        uniform 0.014;
        refGradient     uniform 0;
        valueFraction   uniform 1;
        name            noflux_phifs;
        code            
        #{
            const fvPatch& boundaryPatch = patch();
            const fvBoundaryMesh& boundaryMesh = boundaryPatch.boundaryMesh();
            const fvMesh& mesh = boundaryMesh.mesh();
            const vectorField& Cf = boundaryPatch.Cf();
            const labelList& faceOwner = boundaryPatch.faceCells();

            scalar C1 = 0.0034;
            scalar C2 = 3.25;
            scalar phi_max=0.07;
            scalar zvel=0.0;
            scalar vface=0.0;

            scalar delta;
            scalar D=8.71e-7;

            const volScalarField& phis_cc  = db().lookupObject<volScalarField>("phis");
            const volScalarField& phifs_cc = db().lookupObject<volScalarField>("phifs");
            const volScalarField& ceb_cc   = db().lookupObject<volScalarField>("ceb");
            const fvPatchField<vector>& Uf = boundaryPatch.lookupPatchField<volVectorField,vector>("U");
          
            scalarField Dis = 1.0/mesh.deltaCoeffs().boundaryField()[boundaryPatch.index()];

            vectorField nhat = this->patch().nf();
            scalar t=db().time().value();
            int cellid;

            forAll(Cf, faceI)
            {
                cellid=faceOwner[faceI];
                delta=Dis[faceI];

                zvel = -C1*(exp(-C2*phis_cc[cellid]/phi_max) - exp(-C2))/(1.0 - exp(-C2))*pos(phi_max-phis_cc[cellid]);
                vface = zvel*nhat[faceI][2];

                this->refGrad()[faceI]  = 0.0;
                this->valueFraction()[faceI] = 1.0;
                this->refValue()[faceI] = phifs_cc[cellid]*exp(vface*delta/D);
            }
        #};
    }
    top
    {
        type            codedMixed;
        refValue        uniform 0.014;
        refGradient     uniform 0;
        valueFraction   uniform 1;
        name            noflux_phifs_top;
        code            
        #{
            const fvPatch& boundaryPatch = patch();
            const fvBoundaryMesh& boundaryMesh = boundaryPatch.boundaryMesh();
            const fvMesh& mesh = boundaryMesh.mesh();
            const vectorField& Cf = boundaryPatch.Cf();
            const labelList& faceOwner = boundaryPatch.faceCells();

            scalar C1 = 0.0034;
            scalar C2 = 3.25;
            scalar phi_max=0.07;
            scalar zvel=0.0;
            scalar vface=0.0;

            scalar delta;
            scalar D=8.71e-7;

            const volScalarField& phis_cc  = db().lookupObject<volScalarField>("phis");
            const volScalarField& phifs_cc = db().lookupObject<volScalarField>("phifs");
            const volScalarField& ceb_cc   = db().lookupObject<volScalarField>("ceb");
            const fvPatchField<vector>& Uf = boundaryPatch.lookupPatchField<volVectorField,vector>("U");
          
            scalarField Dis = 1.0/mesh.deltaCoeffs().boundaryField()[boundaryPatch.index()];

            vectorField nhat = this->patch().nf();
            scalar t=db().time().value();
            int cellid;

            forAll(Cf, faceI)
            {
                cellid=faceOwner[faceI];
                delta=Dis[faceI];

                zvel = -C1*(exp(-C2*phis_cc[cellid]/phi_max) - exp(-C2))/(1.0 - exp(-C2))*pos(phi_max-phis_cc[cellid]);
                vface = zvel*nhat[faceI][2];

                this->refGrad()[faceI]  = 0.0;
                this->valueFraction()[faceI] = 1.0;
                this->refValue()[faceI] = phifs_cc[cellid]*exp(vface*delta/D);
            }
        #};
    }
    lateralWall
    {
        type            codedMixed;
        refValue        uniform 0.014;
        refGradient     uniform 0;
        valueFraction   uniform 1;
        name            noflux_phifs_l;
        code            
        #{
            const fvPatch& boundaryPatch = patch();
            const fvBoundaryMesh& boundaryMesh = boundaryPatch.boundaryMesh();
            const fvMesh& mesh = boundaryMesh.mesh();
            const vectorField& Cf = boundaryPatch.Cf();
            const labelList& faceOwner = boundaryPatch.faceCells();

            scalar C1 = 0.0034;
            scalar C2 = 3.25;
            scalar phi_max=0.07;
            scalar zvel=0.0;
            scalar vface=0.0;

            scalar delta;
            scalar D=8.71e-7;

            const volScalarField& phis_cc  = db().lookupObject<volScalarField>("phis");
            const volScalarField& phifs_cc = db().lookupObject<volScalarField>("phifs");
            const volScalarField& ceb_cc   = db().lookupObject<volScalarField>("ceb");
            const fvPatchField<vector>& Uf = boundaryPatch.lookupPatchField<volVectorField,vector>("U");
          
            scalarField Dis = 1.0/mesh.deltaCoeffs().boundaryField()[boundaryPatch.index()];

            vectorField nhat = this->patch().nf();
            scalar t=db().time().value();
            int cellid;

            forAll(Cf, faceI)
            {
                cellid=faceOwner[faceI];
                delta=Dis[faceI];

                zvel = -C1*(exp(-C2*phis_cc[cellid]/phi_max) - exp(-C2))/(1.0 - exp(-C2))*pos(phi_max-phis_cc[cellid]);
                vface = zvel*nhat[faceI][2];

                this->refGrad()[faceI]  = 0.0;
                this->valueFraction()[faceI] = 1.0;
                this->refValue()[faceI] = phifs_cc[cellid]*exp(vface*delta/D);
            }
        #};
    }
}

// ************************************************************************* //
