EH_OpenFOAM/settle_case/constant/EHProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      EHProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mu_l    mu_l    [1 -1 -1 0 0 0 0] 1e-03;
n_mu    n_mu    [0 0 0 0 0 0 0] 3.1;
phi_inf phi_inf [0 0 0 0 0 0 0] 0.09;
phi_max phi_max [0 0 0 0 0 0 0] 0.07;
Ks      Ks      [0 2 -1 0 0 0 0] 8.71e-7;
Kd      Kd      [0 2 -1 0 0 0 0] 4.36e-7;
C1      C1      [0 1 -1 0 0 0 0] 0.0034;
C2      C2      [0 0  0 0 0 0 0] 3.25;
rhos    rhos    [1 -3 0 0 0 0 0] 1500.0;
rhol    rhol    [1 -3 0 0 0 0 0] 1000.0;
solveNavierStokes no;
// ************************************************************************* //
